---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationRelativeFilename
source: html/1e3a16a7-36ba-52c8-0244-c2ae5e91582b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationRelativeFilename Property

"Relative File Name"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationRelativeFilename { get; }
```